app/controllers/home_controller.rb

  def index
    @lists = List.pluck(:id, :name, :description, :image).to_a
---
SELECT `lists`.`id`, `lists`.`name`, `lists`.`description`, `lists`.`image` FROM `lists`

  def create
    List.create(
      name: params[:name],
      description: params[:description],
      image: params[:image],
      created_at: Time.now
    )
---
INSERT INTO `lists` (`name`, `description`, `image`, `created_at`, `updated_at`) VALUES ('sf', 'sdg', 'sdfgs', '2017-11-22 14:55:04', '2017-11-22 14:55:04')

  def change_list
    if params[:delete]
      List.delete(params[:id])
      redirect_to "/"
    elsif params[:update]
      parameters = [params[:new_name], params[:new_description], params[:new_image]]
      List.update(params[:id], name: parameters[0]) if parameters[0].present?
---
DELETE FROM `lists` WHERE `lists`.`id` = 36
UPDATE `lists` SET `image` = 'http://oud.girlscene.nl/images/library/articles/images01/girlscene/hummus.png', `updated_at` = '2017-11-24 11:47:31' WHERE `lists`.`id` = 31